tutorials/multiphase/interFoam/laminar/wave/system/topoSetDict5
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    box;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1e6 -20 -1e6) (1e6 20 1e6);
        }
    }
);

// ************************************************************************* //
